In [6]:
# Dependencies
import pandas as pd
import matplotlib.pyplot as plt
import psycopg2
import sqlalchemy
from config import password
from sqlalchemy import create_engine

In [7]:
# create database connection
engine = create_engine(f'postgresql://postgres:{password}@localhost/Employee_DB')
db_connection = engine.connect()

In [12]:
# import salary data from PostGres
salary_data = pd.read_sql("SELECT * FROM salary", db_connection)
salary_data.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [13]:
# import employee data from PostGres
employee_data = pd.read_sql("SELECT emp_no, emp_title_id FROM employee", db_connection)
employee_data.head()

   emp_no emp_title_id
0  473302        s0001
1  475053        e0002
2   57444        e0002
3  421786        s0001
4  282238        e0003

In [14]:
# import title name from csv
titles_csv = "EmployeeSQL/titles.csv"
titles_df = pd.read_csv(titles_csv, encoding="ISO-8859-1")
titles_df.head()

  title_id          title_name
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [15]:
# merge various dataframes to create base dataframe for visualization
employee_df = pd.merge(employee_data, salary_data, on="emp_no", how="inner")
renamed_df = employee_df.rename(columns={"emp_title_id": "title_id"})
employee_salary_df = pd.merge(renamed_df, titles_df, on="title_id", how="inner")
employee_salary_df.head(10)

   emp_no title_id  salary title_name
0  473302    s0001   40000      Staff
1  421786    s0001   40000      Staff
2  273487    s0001   56087      Staff
3  246449    s0001   87084      Staff
4   48085    s0001   63016      Staff
5  476443    s0001   63371      Staff
6  424270    s0001   60678      Staff
7  427958    s0001   63377      Staff
8  280408    s0001   75963      Staff
9  229010    s0001   40000      Staff